<?php

namespace Service\Fabric\Field\Fields;

use Service\Fabric\Field\IField;
use WBApi\DTO\Addin;
use WBApi\DTO\Card;
use WBApi\DTO\Nomenclature;
use WBApi\DTO\Parameter;
use WBApi\DTO\Variation;

class NomenclatureField implements IField
{

    protected $vendorCode = null;
    protected $photos = null;
    protected $barcode = null;
    protected $price = null;
    protected $size = null;
    protected $colors = [];

    public function __construct($vendorCode, $barcode, $price, $photos, $colors=null, $size=null)
    {
        $this->vendorCode = $vendorCode;
        $this->photos = $photos;
        $this->barcode = $barcode;
        $this->price = $price;
        $this->size = $size;

        if ($colors) {
            foreach (array_unique($colors) as $color) {
                if ($color) $this->colors[] = $color;
            }
        }
    }

    /**
     * @param $card Card
     * @return Card
     */
    function applyField($card)
    {
        $vendorCode = $this->vendorCode;
        $photos = $this->photos;
        $barcode = $this->barcode;
        $price = $this->price;


        if ($card->nomenclatures) {
            $card->nomenclatures[0]->vendorCode = $vendorCode;
            $addinPhoto = new Addin([
                'type' => 'Фото'
            ]);

            foreach ($photos as $photo) {
                $addinPhoto->params[] = new Parameter([
                    'value' => $photo
                ]);
            }
            $card->nomenclatures[0]->addin[] = $addinPhoto;
            $card->nomenclatures[0]->addin[] = new Addin([
                'type' => 'Фото360',
            ]);
            $card->nomenclatures[0]->addin[] = new Addin([
                'type' => 'Видео',
            ]);

            if ( $card->nomenclatures[0]->variations) {

                $card->nomenclatures[0]->variations[0]->addin[] = new Addin([
                    'type' => 'Розничная цена',
                    'params' => [
                        [
                            'count' => (int)$price
                        ]
                    ]
                ]);

                $colors = $this->colors;
                foreach ($colors as $key => $color) {
                    if (!self::$colorsDict[$color]) unset($colors[$key]);
                }
                if ($colors) {
                    $color  =  array_shift($colors);
                    $card->nomenclatures[0]->addin[]  = new Addin([
                        'type' => 'Основной цвет',
                        'params' => [
                            [
                                'value' => $color
                            ]
                        ]
                    ]);
                }
                if ($colors) {
                    $color  =  array_shift($colors);
                    $card->nomenclatures[0]->addin[]  = new Addin([
                        'type' => 'Доп. цвета',
                        'params' => [
                            [
                                'value' =>  $color
                            ]
                        ]
                    ]);
                }

                $size = $this->size;
                if ($size and $this->sizeDict[$size]) {

                    $card->nomenclatures[0]->variations[0]->addin[] = new Addin([
                        'type' => 'Размер',
                        'params' => [
                            [
                                'value' => $this->sizeDict[$size]['r']
                            ]
                        ]
                    ]);

                    $card->nomenclatures[0]->variations[0]->addin[] = new Addin([
                        'type' => 'Рос. размер',
                        'params' => [
                            [
                                'value' => $this->sizeDict[$size]['rr']
                            ]
                        ]
                    ]);
                }


            }
        } else {
            $nomenclature = new Nomenclature([
                'vendorCode' => $vendorCode,
            ]);
            $addinPhoto = new Addin([
                'type' => 'Фото'
            ]);

            foreach ($photos as $photo) {
                $addinPhoto->params[] = new Parameter([
                    'value' => $photo
                ]);
            }
            $nomenclature->addin[] = $addinPhoto;
            $nomenclature->addin[] = new Addin([
                'type' => 'Фото360',
            ]);
            $nomenclature->addin[] = new Addin([
                'type' => 'Видео',
            ]);
            $variation = new Variation([
                'barcode' => $barcode
            ]);
            $variation->addin[] = new Addin([
                'type' => 'Розничная цена',
                'params' => [
                    [
                        'count' => (int)$price
                    ]
                ]
            ]);

            $colors = $this->colors;
            foreach ($colors as $key => $color) {
                if (!self::$colorsDict[$color]) unset($colors[$key]);
            }
            if ($colors) {
                $color  =  array_shift($colors);
                $nomenclature->addin[]  = new Addin([
                    'type' => 'Основной цвет',
                    'params' => [
                        [
                            'value' => $color
                        ]
                    ]
                ]);
            }
            if ($colors) {
                $color  =  array_shift($colors);
                $nomenclature->addin[]  = new Addin([
                    'type' => 'Доп. цвета',
                    'params' => [
                        [
                            'value' =>  $color
                        ]
                    ]
                ]);
            }

            $size = $this->size;
            if ($size and $this->sizeDict[$size]) {

                $variation->addin[] = new Addin([
                    'type' => 'Размер',
                    'params' => [
                        [
                            'value' => $this->sizeDict[$size]['r']
                        ]
                    ]
                ]);

                $variation->addin[] = new Addin([
                    'type' => 'Рос. размер',
                    'params' => [
                        [
                            'value' => $this->sizeDict[$size]['rr']
                        ]
                    ]
                ]);
            }




            $nomenclature->variations[] = $variation;
            $card->nomenclatures[] = $nomenclature;
        }

        return $card;
    }

    public static $colorsDict =  [
        "cине-морской" => "cине-морской",
        "cиний лён" => "cиний лён",
        "cиняя волна" => "cиняя волна",
        "cочный гранат" => "cочный гранат",
        "абрикосовый" => "абрикосовый",
        "абрикосовый крайола" => "абрикосовый крайола",
        "авокадо" => "авокадо",
        "агатовый серый" => "агатовый серый",
        "аквамариновый" => "аквамариновый",
        "акулья кожа" => "акулья кожа",
        "алый" => "алый",
        "амарантово-розовый" => "амарантово-розовый",
        "аметистовый" => "аметистовый",
        "античная бронза" => "античная бронза",
        "античная медь" => "античная медь",
        "античный белый" => "античный белый",
        "антрацитово-серый" => "антрацитово-серый",
        "антрацитовый" => "антрацитовый",
        "апельсин" => "апельсин",
        "атласное серебро" => "атласное серебро",
        "атласный никель" => "атласный никель",
        "баклажановый" => "баклажановый",
        "банановый" => "банановый",
        "бежевый" => "бежевый",
        "бежевый меланж" => "бежевый меланж",
        "беленый дуб" => "беленый дуб",
        "бело-зеленый" => "бело-зеленый",
        "бело-серый" => "бело-серый",
        "бело-синий" => "бело-синий",
        "бело-терракотовый" => "бело-терракотовый",
        "белый" => "белый",
        "белый иней" => "белый иней",
        "белый матовый" => "белый матовый",
        "белый мрамор" => "белый мрамор",
        "белый шоколад" => "белый шоколад",
        "бетон" => "бетон",
        "бирюзово-зеленый" => "бирюзово-зеленый",
        "бирюзовый" => "бирюзовый",
        "бледно розоватый" => "бледно розоватый",
        "бледно-голубой" => "бледно-голубой",
        "бледно-желтый" => "бледно-желтый",
        "бледно-лиловый" => "бледно-лиловый",
        "бледно-пурпурный" => "бледно-пурпурный",
        "бледно-розовый" => "бледно-розовый",
        "бледный папоротник" => "бледный папоротник",
        "блестящий пурпурный" => "блестящий пурпурный",
        "болотный" => "болотный",
        "бордово-фиолетовый" => "бордово-фиолетовый",
        "бордовый" => "бордовый",
        "бордовый меланж" => "бордовый меланж",
        "брезентово-серый" => "брезентово-серый",
        "бриллиантово-синий" => "бриллиантово-синий",
        "бронзовый" => "бронзовый",
        "брусничный" => "брусничный",
        "бургунди" => "бургунди",
        "бэби-голубой" => "бэби-голубой",
        "бэби-розовый" => "бэби-розовый",
        "ванильно-бежевый" => "ванильно-бежевый",
        "ванильный" => "ванильный",
        "васаби" => "васаби",
        "васильковый" => "васильковый",
        "венге" => "венге",
        "верблюжий" => "верблюжий",
        "вереск" => "вереск",
        "винный" => "винный",
        "вишнево-красный" => "вишнево-красный",
        "вишневый" => "вишневый",
        "выбеленный" => "выбеленный",
        "выбеленный дуб" => "выбеленный дуб",
        "галопогосский зеленый" => "галопогосский зеленый",
        "глина" => "глина",
        "глубокий коралловый" => "глубокий коралловый",
        "глубокий коричневый" => "глубокий коричневый",
        "глубокий красный" => "глубокий красный",
        "глубокий пурпурный" => "глубокий пурпурный",
        "глубокий розовый" => "глубокий розовый",
        "глубокий сине-зеленый" => "глубокий сине-зеленый",
        "глубокий фиолетовый" => "глубокий фиолетовый",
        "глубокий черный" => "глубокий черный",
        "голландский синий" => "голландский синий",
        "голубика" => "голубика",
        "голубино-синий" => "голубино-синий",
        "голубой" => "голубой",
        "голубой берилл" => "голубой берилл",
        "голубой лед" => "голубой лед",
        "голубой меланж" => "голубой меланж",
        "голубой тиффани" => "голубой тиффани",
        "голубой туман" => "голубой туман",
        "голубые джинсы" => "голубые джинсы",
        "горошек" => "горошек",
        "горчичный" => "горчичный",
        "горчичный меланж" => "горчичный меланж",
        "горький шоколад" => "горький шоколад",
        "гранатовый" => "гранатовый",
        "графит" => "графит",
        "дельфин" => "дельфин",
        "деним" => "деним",
        "джинс" => "джинс",
        "джинсовый меланж" => "джинсовый меланж",
        "дикий кактус" => "дикий кактус",
        "дуб" => "дуб",
        "дуб бардолино" => "дуб бардолино",
        "дуб белый" => "дуб белый",
        "дуб вотан" => "дуб вотан",
        "дуб галифакс" => "дуб галифакс",
        "дуб сонома" => "дуб сонома",
        "дуб черный" => "дуб черный",
        "дымка" => "дымка",
        "дымчатая роза" => "дымчатая роза",
        "дыня" => "дыня",
        "ежевичный" => "ежевичный",
        "желто-зеленый" => "желто-зеленый",
        "желто-зеленый светлый" => "желто-зеленый светлый",
        "желто-красный" => "желто-красный",
        "желто-оранжевый" => "желто-оранжевый",
        "желто-розовый" => "желто-розовый",
        "желтый" => "желтый",
        "желтый бархат" => "желтый бархат",
        "желтый крайола" => "желтый крайола",
        "желтый неон" => "желтый неон",
        "желтый тюльпан" => "желтый тюльпан",
        "жемчужный" => "жемчужный",
        "жемчужный серый" => "жемчужный серый",
        "защитный хаки" => "защитный хаки",
        "зеленая груша" => "зеленая груша",
        "зеленая липа" => "зеленая липа",
        "зеленая оливка" => "зеленая оливка",
        "зеленка" => "зеленка",
        "зелено-серый" => "зелено-серый",
        "зеленовато-бежевый" => "зеленовато-бежевый",
        "зеленовато-серый" => "зеленовато-серый",
        "зеленовато-синий" => "зеленовато-синий",
        "зеленое лишайник" => "зеленое лишайник",
        "зеленое море" => "зеленое море",
        "зеленое мох" => "зеленое мох",
        "зеленое стекло" => "зеленое стекло",
        "зеленый" => "зеленый",
        "зеленый бархат" => "зеленый бархат",
        "зеленый дым" => "зеленый дым",
        "зеленый лист" => "зеленый лист",
        "зеленый неон" => "зеленый неон",
        "зелёный блеск" => "зелёный блеск",
        "зимний лес" => "зимний лес",
        "золотистый" => "золотистый",
        "изумрудно-зеленый" => "изумрудно-зеленый",
        "изумрудный" => "изумрудный",
        "изумрудный меланж" => "изумрудный меланж",
        "индиго" => "индиго",
        "инжирный" => "инжирный",
        "ирисовый" => "ирисовый",
        "ирландский кофе" => "ирландский кофе",
        "иссиня-черный" => "иссиня-черный",
        "какао" => "какао",
        "кактус" => "кактус",
        "камень" => "камень",
        "камуфляж" => "камуфляж",
        "канареечный" => "канареечный",
        "капучино" => "капучино",
        "карамельный" => "карамельный",
        "карбон" => "карбон",
        "кармин" => "кармин",
        "карри" => "карри",
        "каштановый" => "каштановый",
        "киви" => "киви",
        "киноварь" => "киноварь",
        "кирпично-красный" => "кирпично-красный",
        "кирпичный красный" => "кирпичный красный",
        "клевер" => "клевер",
        "клубника" => "клубника",
        "клубника со сливками" => "клубника со сливками",
        "кобальт" => "кобальт",
        "кокосовое молоко" => "кокосовое молоко",
        "коньячный" => "коньячный",
        "кораллово-красный" => "кораллово-красный",
        "коралловый" => "коралловый",
        "коралловый темный" => "коралловый темный",
        "корица" => "корица",
        "коричневато-розовый" => "коричневато-розовый",
        "коричневая горчица" => "коричневая горчица",
        "коричнево-горчичный мелан" => "коричнево-горчичный мелан",
        "коричнево-серый" => "коричнево-серый",
        "коричневый" => "коричневый",
        "королевский розовый" => "королевский розовый",
        "королевский синий" => "королевский синий",
        "кортен сталь" => "кортен сталь",
        "кофе" => "кофе",
        "кофе с молоком" => "кофе с молоком",
        "кофейный" => "кофейный",
        "краплак красный" => "краплак красный",
        "красно-коричневый" => "красно-коричневый",
        "красно-оранжевый" => "красно-оранжевый",
        "красно-пурпурный" => "красно-пурпурный",
        "красно-розовый меланж" => "красно-розовый меланж",
        "красновато-бордовый" => "красновато-бордовый",
        "красное дерево" => "красное дерево",
        "красный" => "красный",
        "красный бархат" => "красный бархат",
        "красный каркаде" => "красный каркаде",
        "крафт" => "крафт",
        "крем-брюле" => "крем-брюле",
        "кремово-белый" => "кремово-белый",
        "кремовый" => "кремовый",
        "кукурузный" => "кукурузный",
        "кэмел" => "кэмел",
        "лавандово-розовый" => "лавандово-розовый",
        "лавандовый" => "лавандовый",
        "лазурно-серый" => "лазурно-серый",
        "лазурный" => "лазурный",
        "лайм" => "лайм",
        "латте" => "латте",
        "ледник" => "ледник",
        "леопардовый" => "леопардовый",
        "лиловый" => "лиловый",
        "лимонно-желтый" => "лимонно-желтый",
        "лимонный" => "лимонный",
        "лимонный желтый" => "лимонный желтый",
        "лимонный крем" => "лимонный крем",
        "лиственница" => "лиственница",
        "лососевый" => "лососевый",
        "лососевый крайола" => "лососевый крайола",
        "льняной" => "льняной",
        "лёд" => "лёд",
        "маджента розовый" => "маджента розовый",
        "малахит" => "малахит",
        "малиново-красный" => "малиново-красный",
        "малиново-розовый" => "малиново-розовый",
        "малиновый" => "малиновый",
        "манго" => "манго",
        "мандариновый" => "мандариновый",
        "маренго" => "маренго",
        "марсала" => "марсала",
        "матовое золото" => "матовое золото",
        "матовый никель" => "матовый никель",
        "махагон" => "махагон",
        "медный" => "медный",
        "медовый" => "медовый",
        "медь" => "медь",
        "ментол" => "ментол",
        "месмери" => "месмери",
        "металл" => "металл",
        "милитари" => "милитари",
        "мокко" => "мокко",
        "мокрый асфальт" => "мокрый асфальт",
        "молочный" => "молочный",
        "молочный шоколад" => "молочный шоколад",
        "морковный" => "морковный",
        "морская волна" => "морская волна",
        "морская пена" => "морская пена",
        "морской" => "морской",
        "морской зеленый" => "морской зеленый",
        "морской лёд" => "морской лёд",
        "мох" => "мох",
        "мохито" => "мохито",
        "мрамор" => "мрамор",
        "мышино-серый" => "мышино-серый",
        "мягкий белый" => "мягкий белый",
        "мягкий розовый" => "мягкий розовый",
        "мята пыльная" => "мята пыльная",
        "мятно-бирюзовый" => "мятно-бирюзовый",
        "мятный" => "мятный",
        "натуральный" => "натуральный",
        "небесно-голубой" => "небесно-голубой",
        "небесный" => "небесный",
        "нежная мята" => "нежная мята",
        "нежно-голубой" => "нежно-голубой",
        "нежный коралл" => "нежный коралл",
        "нежный розовый" => "нежный розовый",
        "незрелый желтый" => "незрелый желтый",
        "нержавеющая сталь" => "нержавеющая сталь",
        "ниагара" => "ниагара",
        "нюдовый" => "нюдовый",
        "облепиха" => "облепиха",
        "огненно-красный" => "огненно-красный",
        "океан" => "океан",
        "оливковый" => "оливковый",
        "оранжево-желтый" => "оранжево-желтый",
        "оранжево-красный" => "оранжево-красный",
        "оранжево-розовый" => "оранжево-розовый",
        "оранжевый" => "оранжевый",
        "оранжевый витамин" => "оранжевый витамин",
        "оранжевый неон" => "оранжевый неон",
        "орех" => "орех",
        "орхидея" => "орхидея",
        "охотничий зеленый" => "охотничий зеленый",
        "охра" => "охра",
        "охра желтая" => "охра желтая",
        "папоротник" => "папоротник",
        "пастельно-голубой" => "пастельно-голубой",
        "пастельно-оранжевый" => "пастельно-оранжевый",
        "пастельно-розовый" => "пастельно-розовый",
        "патина" => "патина",
        "пепел" => "пепел",
        "перванш" => "перванш",
        "перламутрово-зелёный" => "перламутрово-зелёный",
        "перламутрово-оранжевый" => "перламутрово-оранжевый",
        "перламутрово-розовый" => "перламутрово-розовый",
        "перламутрово-рубиновый" => "перламутрово-рубиновый",
        "перламутровый" => "перламутровый",
        "перламутровый голубой" => "перламутровый голубой",
        "перламутровый медный" => "перламутровый медный",
        "перламутровый ночной сини" => "перламутровый ночной сини",
        "персидский индиго" => "персидский индиго",
        "персидский красный" => "персидский красный",
        "персиковая нуга" => "персиковая нуга",
        "персиково-розовый" => "персиково-розовый",
        "персиковый" => "персиковый",
        "персиковый крайола" => "персиковый крайола",
        "персиковый крем" => "персиковый крем",
        "песочно-желтый" => "песочно-желтый",
        "песочный" => "песочный",
        "петрол" => "петрол",
        "пигментный зеленый" => "пигментный зеленый",
        "подснежник" => "подснежник",
        "полынь" => "полынь",
        "портвейн" => "портвейн",
        "прозрачный" => "прозрачный",
        "прозрачный кристалл" => "прозрачный кристалл",
        "пудровый" => "пудровый",
        "пурпур" => "пурпур",
        "пурпурно-красный" => "пурпурно-красный",
        "пурпурно-розовый" => "пурпурно-розовый",
        "пурпурно-синий" => "пурпурно-синий",
        "пшеничный" => "пшеничный",
        "пыль-оливковый" => "пыль-оливковый",
        "пыльная роза" => "пыльная роза",
        "пыльный бежевый" => "пыльный бежевый",
        "радикальный красный" => "радикальный красный",
        "резедово-зеленый" => "резедово-зеленый",
        "розовато-серый" => "розовато-серый",
        "розовая гвоздика" => "розовая гвоздика",
        "розовая долина" => "розовая долина",
        "розовая пудра" => "розовая пудра",
        "розовая фуксия" => "розовая фуксия",
        "розово-золотой" => "розово-золотой",
        "розово-коралловый" => "розово-коралловый",
        "розово-коричневый" => "розово-коричневый",
        "розово-лавандовый" => "розово-лавандовый",
        "розово-пурпурный" => "розово-пурпурный",
        "розовое золото" => "розовое золото",
        "розовое облако" => "розовое облако",
        "розовый" => "розовый",
        "розовый антик" => "розовый антик",
        "розовый грейфрут" => "розовый грейфрут",
        "розовый жемчуг" => "розовый жемчуг",
        "розовый кварц" => "розовый кварц",
        "розовый лимонад" => "розовый лимонад",
        "розовый меланж" => "розовый меланж",
        "розовый персик" => "розовый персик",
        "розовый песок" => "розовый песок",
        "розовый тауп" => "розовый тауп",
        "розовый фламинго" => "розовый фламинго",
        "рубиновый" => "рубиновый",
        "румянец" => "румянец",
        "рыжий" => "рыжий",
        "рыжий терракот" => "рыжий терракот",
        "салатовый" => "салатовый",
        "сапфирово-синий" => "сапфирово-синий",
        "сапфировый" => "сапфировый",
        "сатиновый" => "сатиновый",
        "свежая папайя" => "свежая папайя",
        "светлая фиалка" => "светлая фиалка",
        "светло серо-зеленый" => "светло серо-зеленый",
        "светло-бежевый" => "светло-бежевый",
        "светло-бирюзовый" => "светло-бирюзовый",
        "светло-голубой" => "светло-голубой",
        "светло-желтый" => "светло-желтый",
        "светло-зеленый" => "светло-зеленый",
        "светло-золотистый" => "светло-золотистый",
        "светло-каштановый" => "светло-каштановый",
        "светло-коралловый" => "светло-коралловый",
        "светло-коричневый" => "светло-коричневый",
        "светло-оливковый" => "светло-оливковый",
        "светло-оранжевый" => "светло-оранжевый",
        "светло-песочный" => "светло-песочный",
        "светло-петрольный" => "светло-петрольный",
        "светло-пурпурный" => "светло-пурпурный",
        "светло-розовый" => "светло-розовый",
        "светло-русый" => "светло-русый",
        "светло-серый" => "светло-серый",
        "светло-серый меланж" => "светло-серый меланж",
        "светло-синий" => "светло-синий",
        "светло-сиреневый" => "светло-сиреневый",
        "светло-фиолетовый" => "светло-фиолетовый",
        "светлое какао" => "светлое какао",
        "светлый антрацит" => "светлый антрацит",
        "светлый джинс" => "светлый джинс",
        "светлый опаловый" => "светлый опаловый",
        "светлый песок" => "светлый песок",
        "светлый синевато-зеленый" => "светлый синевато-зеленый",
        "светлый фисташковый" => "светлый фисташковый",
        "светлый хаки" => "светлый хаки",
        "сгоревший желтый" => "сгоревший желтый",
        "серебристо-белый" => "серебристо-белый",
        "серебристый" => "серебристый",
        "серо-бежевый" => "серо-бежевый",
        "серо-бежевый светлый" => "серо-бежевый светлый",
        "серо-голубой" => "серо-голубой",
        "серо-голубой светлый" => "серо-голубой светлый",
        "серо-зеленый" => "серо-зеленый",
        "серо-зеленый джинсовый" => "серо-зеленый джинсовый",
        "серо-коричневый" => "серо-коричневый",
        "серо-синий" => "серо-синий",
        "серо-фиолетовый" => "серо-фиолетовый",
        "серовато-зеленый" => "серовато-зеленый",
        "серовато-красный" => "серовато-красный",
        "серовато-пурпурный" => "серовато-пурпурный",
        "серовато-розовый" => "серовато-розовый",
        "серый" => "серый",
        "серый меланж" => "серый меланж",
        "серый шелк" => "серый шелк",
        "сигнальный серый" => "сигнальный серый",
        "сигнальный синий" => "сигнальный синий",
        "сиена жженая" => "сиена жженая",
        "сине-серый" => "сине-серый",
        "сине-фиолетовый" => "сине-фиолетовый",
        "синевато-зеленый" => "синевато-зеленый",
        "синевато-серый" => "синевато-серый",
        "синий" => "синий",
        "синий бархат" => "синий бархат",
        "синий кобальт" => "синий кобальт",
        "синий космос" => "синий космос",
        "синий петроль" => "синий петроль",
        "синий серый" => "синий серый",
        "синяя лазурь" => "синяя лазурь",
        "сиреневый" => "сиреневый",
        "сиреневый меланж" => "сиреневый меланж",
        "сливовый" => "сливовый",
        "слоновая кость" => "слоновая кость",
        "солнечно-желтый" => "солнечно-желтый",
        "соломенный" => "соломенный",
        "сосна" => "сосна",
        "сосна касцина" => "сосна касцина",
        "сосна пасадена" => "сосна пасадена",
        "сосновый лес" => "сосновый лес",
        "спелый клементин" => "спелый клементин",
        "средне-серый" => "средне-серый",
        "средне-серый меланж" => "средне-серый меланж",
        "стальной голубой" => "стальной голубой",
        "стальной графит" => "стальной графит",
        "старое кружево" => "старое кружево",
        "сумеречный" => "сумеречный",
        "супер белый" => "супер белый",
        "суровый темно-синий" => "суровый темно-синий",
        "сухая зелень" => "сухая зелень",
        "табачный" => "табачный",
        "тауп" => "тауп",
        "телесный" => "телесный",
        "темная зеленая оливка" => "темная зеленая оливка",
        "темная лаванда" => "темная лаванда",
        "темная мята" => "темная мята",
        "темная сепия" => "темная сепия",
        "темная сирень" => "темная сирень",
        "темная слива" => "темная слива",
        "темная фуксия" => "темная фуксия",
        "темно серо-зеленый" => "темно серо-зеленый",
        "темно-алый" => "темно-алый",
        "темно-бежевый" => "темно-бежевый",
        "темно-бирюзовый" => "темно-бирюзовый",
        "темно-бордовый" => "темно-бордовый",
        "темно-бурый" => "темно-бурый",
        "темно-голубой" => "темно-голубой",
        "темно-горчичный" => "темно-горчичный",
        "темно-желтый" => "темно-желтый",
        "темно-зеленый" => "темно-зеленый",
        "темно-каштановый" => "темно-каштановый",
        "темно-коричневый" => "темно-коричневый",
        "темно-красный" => "темно-красный",
        "темно-лазурный" => "темно-лазурный",
        "темно-оливковый" => "темно-оливковый",
        "темно-оранжевый" => "темно-оранжевый",
        "темно-персиковый" => "темно-персиковый",
        "темно-петрольный" => "темно-петрольный",
        "темно-пурпурный" => "темно-пурпурный",
        "темно-розовый" => "темно-розовый",
        "темно-серый" => "темно-серый",
        "темно-серый меланж" => "темно-серый меланж",
        "темно-синий" => "темно-синий",
        "темно-синий графитовый" => "темно-синий графитовый",
        "темно-синий джинсовый" => "темно-синий джинсовый",
        "темно-фиолетовый" => "темно-фиолетовый",
        "темный горький шоколад" => "темный горький шоколад",
        "темный дуб" => "темный дуб",
        "темный желто-зеленый" => "темный желто-зеленый",
        "темный металл" => "темный металл",
        "темный никель" => "темный никель",
        "темный синий меланж" => "темный синий меланж",
        "темный хаки" => "темный хаки",
        "темный циан" => "темный циан",
        "теплый белый" => "теплый белый",
        "терракот меланж" => "терракот меланж",
        "терракота" => "терракота",
        "терракотовый" => "терракотовый",
        "терракотовый меланж" => "терракотовый меланж",
        "титан" => "титан",
        "томатный" => "томатный",
        "топленое молоко" => "топленое молоко",
        "торфяное болото" => "торфяное болото",
        "травяной зеленый" => "травяной зеленый",
        "туман" => "туман",
        "тускло-розовый" => "тускло-розовый",
        "тускло-сиреневый" => "тускло-сиреневый",
        "ультрамариновый" => "ультрамариновый",
        "умбра жженая" => "умбра жженая",
        "умбра натуральная" => "умбра натуральная",
        "умеренно зеленый" => "умеренно зеленый",
        "умеренный розовый" => "умеренный розовый",
        "феррара" => "феррара",
        "фиалковый" => "фиалковый",
        "фиолетово-баклажанный" => "фиолетово-баклажанный",
        "фиолетовый" => "фиолетовый",
        "фиолетовый меланж" => "фиолетовый меланж",
        "фисташковый" => "фисташковый",
        "флокс" => "флокс",
        "фуксия" => "фуксия",
        "фундук" => "фундук",
        "хаки" => "хаки",
        "холодная полынь" => "холодная полынь",
        "холодный белый" => "холодный белый",
        "хром" => "хром",
        "хром бриллиант" => "хром бриллиант",
        "хром матовый" => "хром матовый",
        "черненый старинный цинк" => "черненый старинный цинк",
        "чернильный" => "чернильный",
        "черничный" => "черничный",
        "черно-зеленый" => "черно-зеленый",
        "черно-красный" => "черно-красный",
        "черный" => "черный",
        "черный графит" => "черный графит",
        "черный лакированный никел" => "черный лакированный никел",
        "черный матовый" => "черный матовый",
        "черный меланж" => "черный меланж",
        "черный с коричневым" => "черный с коричневым",
        "шалфей" => "шалфей",
        "шампань" => "шампань",
        "шафрановый" => "шафрановый",
        "шоколадный" => "шоколадный",
        "эвкалипт" => "эвкалипт",
        "экрю" => "экрю",
        "электрик" => "электрик",
        "эскимо" => "эскимо",
        "янтарный" => "янтарный",
        "яркий оранжевый" => "яркий оранжевый",
        "ярко-голубой" => "ярко-голубой",
        "ярко-желтый" => "ярко-желтый",
        "ярко-зеленый" => "ярко-зеленый",
        "ярко-красный" => "ярко-красный",
        "ярко-розовый" => "ярко-розовый",
        "ярко-синий" => "ярко-синий",
        "ясень анкор тёмный" => "ясень анкор тёмный",
        "ясень белый" => "ясень белый",
        "ясень графит" => "ясень графит",
        "ясень снежный" => "ясень снежный",
        "ясень шимо светлый" => "ясень шимо светлый",
        "ясень шимо темный" => "ясень шимо темный"
    ];

    private $sizeDict = [
        '6 мм'=> [
            'r'=> '6 мм',
            'rr'=> '6'
        ],
        '8 мм'=> [
            'r'=> '8 мм',
            'rr'=> '8'
        ],
        '10 мм'=> [
            'r'=> '10 мм',
            'rr'=> '10'
        ],
        '12 мм'=> [
            'r'=> '12 мм',
            'rr'=> '12'
        ],
        '14 мм'=> [
            'r'=> '14 мм',
            'rr'=> '14'
        ],
        '16 мм'=> [
            'r'=> '16 мм',
            'rr'=> '16'
        ],
        '18 мм'=> [
            'r'=> '18 мм',
            'rr'=> '18'
        ],
        '19 мм'=> [
            'r'=> '19 мм',
            'rr'=> '19'
        ],
        '20 мм'=> [
            'r'=> '20 мм',
            'rr'=> '20'
        ],
        '21 мм'=> [
            'r'=> '21 мм',
            'rr'=> '21'
        ],
        '22 мм'=> [
            'r'=> '22 мм',
            'rr'=> '22'
        ],
        '24 мм'=> [
            'r'=> '24 мм',
            'rr'=> '24'
        ],
        '26 мм'=> [
            'r'=> '26 мм',
            'rr'=> '26'
        ],
        '28 мм'=> [
            'r'=> '28 мм',
            'rr'=> '28'
        ],
        '30 мм'=> [
            'r'=> '30 мм',
            'rr'=> '30'
        ],
        '33 мм'=> [
            'r'=> '33,5 мм',
            'rr'=> '33,5'
        ],
        '20х16 мм'=> [
            'r'=> '20 мм',
            'rr'=> '20'
        ],
        '20х20 мм'=> [
            'r'=> '20 мм',
            'rr'=> '20'
        ],
        '22х18 мм'=> [
            'r'=> '22 мм',
            'rr'=> '22'
        ],
        '22х22 мм'=> [
            'r'=> '22 мм',
            'rr'=> '22'
        ],
        '24х20 мм'=> [
            'r'=> '24 мм',
            'rr'=> '24'
        ],
        '24х18 мм'=> [
            'r'=> '24 мм',
            'rr'=> '18'
        ],
        '24х24 мм'=> [
            'r'=> '24 мм',
            'rr'=> '24'
        ],
    ];
}